app/controllers/after_signup_controller.rb

  def update
    @user = current_user
    @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Makamaru"], ["updated_at", "2015-08-07 12:10:33.876013"], ["id", 1]]